[{"time":[2022,5,25],"title":"导数","tags":["随笔","高中数学"],"content":"导数如您所见这一章节讲的是导数听起来挺高大上的但不是非常难那就随我了解导数及其应用吧预备知识利用直线上两点求斜率是直线与轴正方向的夹角通过斜率和直线上的一点求直线方程是直线上一点导数的定义的意义是是借助斜率描述在处的增减及增减快慢值正则增且越大增越快值负则减且越小减越快单调性是对增减性的定性分析导数则是对增减性的定量分析导数的几何意义是曲线在点处的切线斜率切线方程利用计算器的功能可求导数值例利用导数的定义求在处的导数及该函数在处的切线方程切线方程"},{"time":[2022,5,18],"title":"何为数理分析","tags":["随笔","高中数学"],"content":"何为数理分析数理分析是一种非常非常抽象的数学思想它不能帮你解决任何问题但是它可以帮你梳理出解决各种问题的思路基本思想数理分析的基本思想等式即方程用掉一个等式可以减少一个未知数的个数即消元最终获得只含一个未知数的等式代数式或不等式所谓的数理分析即在正式计算前的一种预测即将多于等式的未知数全部用掉后在最终一个等式的情况下未知数还剩几个若只剩一个未知数可求值若剩两个未知数则可求范围本质是最值值域问题问题若剩超过两个未知数则此题还有变数可能是条件还没有找到可能需要等待一个巧合可能是双变量等等不等式问题需注意可解的不等式只能含一个变量不等式组也只含一个变量不等式组只是解集的交并关系不等式不可用来消元多变量的不等式是线性规划问题同向可加性是最简线性规划问题可分别解得可求的范围未必可解分别解完后求交集线性规划同向可加利用等式消元将变为可解不等式"},{"time":[2022,5,16],"title":"复数的概念与计算","tags":["随笔","高中数学"],"content":"复数引入复数是对数域的最后一次拓展现在那些初中数学认为不能表示的数也可以表示并参与运算了概念所有的复数都必须化到才能判断类型代数计算四则运算加减乘与实数域的算法一致除法使用分母实数化同乘分母的共轭复数先二次方三次方遇时平方后必为纯虚数遇与成关系时立方后必为纯虚数或实数的高次的四连次方相加为0记的三连次方相加为0复系数方程实系数一元二次方程需要分类成方程有实根和有虚根实根部分可使用根的判别式求根公式韦达定理以及实系数一元二次方程可使用求根公式以及韦达定理但不可使用实系数一元二次方程若有虚根则必为共轭虚根因式分解求出代数式所对应方程的两个根与如果二次项系数不为1需要先提出实数的平方根可以利用方程的根为虚系数方程一个等式即方程只要系数出现唯一的方法实部=实部虚部=虚部无论题目叙述得多么花哨看到含的等式就应该按照上述的做法去做建议默念一百遍令看清的条件注意舍解整理为解方程组虚数的平方根按照平方根列虚系数方程用实部=实部虚部=虚部解例求的平方根令几何意义复数对应复平面上的点复平面上的实轴轴虚轴去掉原点的轴加减法的几何意义的平行四边形法则的几何意义模的几何意义到的距离"},{"time":[2022,5,15],"title":"三角比的概念","tags":["随笔","高中数学","三角学"],"content":"三角比的概念欢迎来到三角比和三角函数的世界！高中的三角学在初中的基础上增加了一堆东西希望慢慢读完哦概念请注意要求角先求三角比因为三角比好求而角难求角度与弧度的转换角度转弧度弧度转角度不要以是否带判断是否为弧度制没有角度单位的都是弧度制计算器上角度制与弧度制的切换打开设置找到`角度单位`切换角度单位任意角的定义主值决定位置频率值决定频率表示第一次出现在而后每过再出现一次表示第一次出现在而后每过再出现一次角转终边先画主值所对应的终边再根据频率值画出其他部分注意正角逆时针负角顺时针终边转角找到一个终边所对应的值或范围再按其出现的频率添加频率值三角比的定义单位圆应该有5圈角度弧度单位圆用表示点以轴正半轴为始边求终边上点的坐标时使用=到原点的距离=与轴正半轴的夹角平面上任意一点可以表示成在具体计算过程中思路一定要绕过必须求出具体的角因为真正需要的并不是角而是与公式同角三角比三平方公式利用直角三角形求比值用象限判断符号注意符号相同的三角比与与与诱导公式当已知角是的整数倍时使用口诀奇变偶不变符号看象限老师会讲的我就不多嘴了诱导公式是和差角公式推导出来的是最优变名角七组变角公式和差角公式倍角公式降幂公式在倍角公式中找出的半角公式降幂开根万能置换公式"},{"time":[2022,5,10],"title":"求解不等式","tags":["随笔","高中数学"],"content":"不等式问题求解不等式是为了找到使不等式成立的自变量的范围或者求代数式中自变量的范围在这篇博客中我将向您展示高中数学中不等式的解法其中包括5种最基本的不等式一元二次不等式分式不等式绝对值不等式最简指对不等式三角不等式以及利用函数性质解不等式有名这里讲述的是5种最基本的不等式在上面的列表中已经说明了它们是可以叫得出名字的不是那些奇奇怪怪的不等式它们是下面的本质章节将要论述的一元二次不等式可先求解一元二次方程找到两根若则结果的取值是两根之外所有数的集合否则结果为两根之内在的条件下如果那么应该先画出二次函数的图像再做判断分式不等式移项通分变为标准格式然后可以变为求解如果或则将分母对应的解由闭变为开高次不等式使用穿针引线法将所有的根都表示在数轴上由右上方开始穿过每一个根再按不等号的方向总结解集奇次方穿过数轴偶次方不穿过数轴分母所对应的解由闭变为开无视的因式含参影响不等号方向的影响根大小的是分类的基本要素注意和不等式恒成立的区别求的是变量绝对值不等式例零值点分段法将绝对值内等于零的值作为临界点两边平方最简指对不等式最简指数不等式用对数恒等式当不等号方向不变不等号变向最简对数不等式1当不等号方向不变不等号变向注意真数大于0与结果做交集三角不等式与用单位圆横向截取单位圆纵截按逆时针方向找到始边与终边写出区间如果起始值大于结束值则最后添加频率值与反三角利用函数图象本质有些不等式你叫不出来名字不要犹豫使用下面的做法借图一般来说不等式总是先化简成再用合适的方法解决之这样的话就可以画出的图像横截然后找解集利用单调性处理或时应利用单调性绝不应该带入优先判断其单调性"},{"time":[2022,4,13],"title":"简单的手写数字识别","tags":["随笔","计算机"],"content":"简单的手写数字识别如标题所示本篇博客将要讲述的是手写数字的识别不过说实话讲解人工智能的高深理论实属无聊不过前提是我要能看懂它那就换一种更直观的算法来实现手写数字的识别吧"},{"time":[2022,3,26],"title":"三角化简","tags":["随笔","高中数学","三角学"],"content":"三角化简三角化简我的理解就是将含有三角比三角函数的代数式做某些运算转化为更为简单的式子三角化简包含三角比的化简和三角函数的化简它们的目的是不同的三角比化简求另外一个包含三角比的代数式单变量化简多变量化简三角函数化简求值域对称轴单调区间等函数性质整式路线分式路线三角比化简还请注意要求角先求三角比因为三角比好求而角难求单变量化简单变量化简分三步先化成同角使用和差角公式诱导公式倍角公式降幂公式半角公式万能公式切割化弦使用四倒商公式全切不化弦上下齐两边平方得2+1凑平方角的妙用角的妙用只有在已知条件展开后过于复杂时才使用毕竟这个方法比较复杂有一部分角的展开并不麻烦下面这个奇怪的类比我们数学老师说的说不定有助于帮助你判断何种时候用何种方法就像你非常喜欢的一个人向你告白你肯定非常愉快的接受了可以使用诱导公式直接消除是那种平平无奇的人向你告白事后你认为这个人还不错不过这种人可以给你幸福感觉数学老师亲历过一样和差角展开之后提取公因数就可以了或这种人不要说告白了其他情况下你连理都不理很遗憾这种角展开后过于复杂使用角的妙用吧使用角的妙用应该保持条件角不变将问题角变为条件角的线性组合并展开问题一般可令已知角为凑完全平方多变量化简多变量应优先减少变量个数再切割化弦三角形三内角问题使用减少变量角的妙用同单变量化简但不能设要选择在所求范围内有正有负的三角比名问题利用平方相加消元平方相加后所得的三角比名可改角无法改如果不是题目中要求的角此方法行不通利用和差化积变角看看上级标题前后名要一致才可用此方法若利用平方相加无法得到所求角时尝试使用和差化积得或再消元三角函数化简整式路线这里需要用到两个知识点辅助角公式这是对的和差角公式的反向推导其中的确定先判断象限再定角第四象限用负角角次=角的系数角的次数是常数例如的角次是12=2对其使用任何变角公式其角次都不变读者可亲自尝试一下利用辅助角当每项的角次相同时可使用辅助角公式转换为含sin的式子需要将每项的角的次数转换为1时再使用辅助角公式例求的值域的角次是21=2的角次是12=2角次相同故使用辅助角角的次数是2需要对它使用变角公式其中在第四象限得由此得值域二次角次不相同时才应该使用这个知识点利用降次公式和倍角公式升次只有二次项可变三角名使用与同在令两边平方得"},{"time":[2022,2,8],"title":"高中值域问题的基本做法","tags":["随笔","高中数学"],"content":"值域问题总的来说值域问题的做法可总结为作图描深定义域由下往上找对应纵坐标的范围那就通过本文入门高中数学吧最值值域问题最基本理念将待求的范围和最值部分用一个字母表示得到函数并求值域举例来说要知道今天最低气温是多少必须先知道今天气温关于时间的函数基础函数求值域这里是最难理解的部分请认真阅读这一部分内容有图本质步骤很简单就如开头所说的三步作函数图像单调函数直接代端点就可以了不要这么麻烦描深定义域由下往上找对应纵坐标的范围这里有个问题何为有图有图即函数可作图再讲的仔细一点就是您了解函数性质的函数更仔细的讲解请看该博客的历史版本无图复合很遗憾不是所有的题目都这么友好它们没有图那恭喜你需要使用复合函数求值域了复合函数求值域就是将不能作图的函数变得可以作图通过复合出内外函数以内函数的值域作为外函数的定义域即可求外函数的值域型分离常数反比平移型令可以变成耐克函数型变成型变成非复合你使用了复合函数求值域发现它的几个方法都不能让你继续作图那么你就应该使用此方法既然你作不出函数的图像那就应该用最原始的方法来作图描点法计算器可以帮助到你请看这个函数我们要求它在的值域很显然对这个解析式复合都不能画出它的函数图像我们就应该使用描点法通过计算器列表可得该函数在上递减xy497335213150212根据题意得函数单调递减三角函数求值域这里针对的形式进行叙述其它的三角函数做法是相同的三角函数题型复杂如果不是上面标准形式的可以先阅读三角函数化简定义域为函数的值域为定义域不为根据之前的理论是可以作图的使用五点法但是这样的计算量大浪费时间易出错故不太合适不过我们要辩证的看待这两种方法描点法与复合函数法复合函数法并不适用于函数有解问题同时根据复合函数求值域的做法该函数可复合成以下几个函数只有这个函数需要画图不过只是标准图像以内函数的值域作为外函数的定义域即可求外函数的值域且计算量大大减少搞定！"},{"time":[2022,1,24],"title":"放下是我们必须要做的选择","tags":["议论文"],"content":"放下是我们必须要做的选择人生路漫漫每时每刻我们总是面临着很多选择有时遇到困难请不要轻言放弃而是应该放下它们学会放下才能成就一个更好的自己放下有助于缓解内心的负面情绪在现代社会时间非常宝贵大家都努力加快自己的生活节奏渴望获得一个更好的人生由此必定会产生诸如焦虑浮躁等负面情绪反而会影响工作对于职场人士何不尝试放下手头上的工作去山野间换换气必定会精神百倍学生的话也可以在课余时间暂时放下课本拥抱自然来放松心情放下了可以缓解心理压力调整身心做回一个更好的自己但是放下之后不要忘记去重新拾起它们不然就会像方仲永一样放不下自己的名声最终泯然众人矣同时放下也是走向成功的一个好方法从古至今很多人就因此而获得成功或被后人敬仰或赚得盆钵皆满比如说东晋大诗人陶渊明他中年时期看透了官场的黑暗年少时很想出仕的他现在不为五斗米折腰放下了官职隐居山林无官一身轻的他怡然自乐得以创作出许多名篇流传千古还有美国人乔布斯以及同时期的比尔盖茨他们上大学的时候正值极客文化的新盛之时乔布斯就从制作售卖蓝盒子开始创业其后放下了大学的学业创办了苹果公司才有了如今世界文明的苹果手机与电脑盖茨与乔布斯相似在哈佛读书的他为了寻求自己的梦想放下学习开发了著名的科技产品放弃它是一种消极的人生态度它让我们觉得毫无希望没有动力最终过完平庸的一生而放下则完全不同虽只有一字之差但它是一种积极的人生态度是一种释然让我们成为更好的自己懂得放下才能更专注于眼前的事情人生一定是有得有失的选择在此刻放下在将来的彼刻拾起才能赢得人生的成功"},{"time":[2022,1,8],"title":"第一篇文章","tags":["随笔"],"content":"第一篇文章读者您好这是我的个人主页兼写博客的地方是这个githubpage发布时写的的第一篇文章我这篇文章的作者是一名高中生不过可千万不要小看高中生知识的广度与深度我可是文理通吃虽然这里主要展示的是偏理的文章但是我的文笔以及思辨能力也是不错的那鄙人为何要写博客呢首先高中的学业还是比较轻松的每天有至少两个小时的自由时间以少量睡眠为代价社团活动也是不错的其次有这么多知识储备不分享出来实属浪费还不如整理成文字让大家都知道最后这是青春啊！这段美好的记忆要用一生去感受基于以上原因我决定开始写博客博客的分类如下议论文结构文笔不错的考场作文随笔随便写写的东西文学范围好广啊随便写写吧高中数学老师讲得很好笔记具有很强的逻辑性清晰易懂三角学高中数学的大头之一计算机本行不能忘当然啦我在家没事干的时候更喜欢看番写博客这种事情可不常干毕竟要动脑筋对吧一个月写一篇就不错了典型的鸽子哦千万不要认为这个网站只包含了博客那就太看不起我了这一整个网站都是我为我自己私人定制的不细细观察怎能发现乐趣顺便一提我极少认为我写的东西是完美的所以这里的每篇博客应该都会重写几遍力求精简直白最后的最后这篇博客会随着时间的推移略微变化"}]